
% %%%%%%%%杆 长%%%%%%%%%
%m
L_model = zeros([1,3]);
L_model(1) = 0;
L_model(2) = 0.13;
L_model(3) = 0.13;
%%%%%%%%%%%%%%%%%%%%%%%%


% %%%%%%%%质 量%%%%%%%%%
%Kg
M_model = zeros([1,3]);
M_model(1) = 0;
M_model(2) = 0.6;
M_model(3) = 0.1;
%%%%%%%%%%%%%%%%%%%%%%%%


%%%%%%%%转 动 惯 量%%%%%%
%这些是惯性张量对角线上的元素
%Kg^m^2
I1_model = [ 0.1 0.1 0.1 ];
I2_model = [ 0 0.012 0.012 ];
I3_model = [ 0 0.00133 0.00133 ];
%%%%%%%%%%%%%%%%%%%%%%%%


%%%%%%%%质 心 位 置%%%%%%
%参考坐标系在杆的中间[x y z]
%[0 0 0]代表就在杆中心
%注意和算法中的表示区分
%算法是以标准DH参数本杆坐标系为参考的
%m
rc1_model = [ 0 0 0 ];
rc2_model = [ L_model(2)/2 0 0 ];
rc3_model = [ L_model(3)/2 0 0 ];
%%%%%%%%%%%%%%%%%%%%%%%%